avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
	*msg_buf++ = SrcAddrSpec->AddrMode;

#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = SrcAddrSpec->PANId >> 8;
	*msg_buf++ = SrcAddrSpec->PANId;
#else
	*msg_buf++ = SrcAddrSpec->PANId;
	*msg_buf++ = SrcAddrSpec->PANId >> 8;
#endif
	memcpy(msg_buf, &(SrcAddrSpec->Addr), 8);
	msg_buf += 8;
	*msg_buf++ = DstAddrSpec->AddrMode;

#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = DstAddrSpec->PANId >> 8;
	*msg_buf++ = DstAddrSpec->PANId;
#else
	*msg_buf++ = DstAddrSpec->PANId;
	*msg_buf++ = DstAddrSpec->PANId >> 8;
#endif
	memcpy(msg_buf, &(DstAddrSpec->Addr), 8);
	msg_buf += 8;
	*msg_buf++ = mpduLinkQuality;
	*msg_buf++ = DSN;
    #ifdef ENABLE_TSTAMP
	*msg_buf++ = Timestamp;
	*msg_buf++ = Timestamp >> 8;
	*msg_buf++ = Timestamp >> 16;
	*msg_buf++ = Timestamp >> 24;
    #endif  /* ENABLE_TSTAMP */
	*msg_buf++ = msduLength;

	/*
	 * The second length of the MSDU is required since the test harness
	 * requires the length as first element of each variable list.
	 */
	*msg_buf++ = msduLength;
	memcpy(msg_buf, msdu, msduLength);
	msg_buf += msduLength;
	*msg_ptr_to_size += msduLength;
	*msg_buf = EOT;
}

#if (MAC_PURGE_REQUEST_CONFIRM == 1)

/*
 * Callback function that must be implemented by application (NHLE) for MAC
 *service
 * MCPS-PURGE.confirm.
 *
 * @param msduHandle           Handle (id) of MSDU to be purged.
 * @param status               Result of requested purge operation.
 *
 * @return void
 */
void usr_mcps_purge_conf(uint8_t msduHandle,
		uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MCPS_PURGE_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MCPS_PURGE_CONFIRM;
	*msg_buf++ = msduHandle;
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#endif /* MAC_PURGE_REQUEST_CONFIRM */

#if (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) || defined(DOXYGEN)

/*
 * Callback function usr_mlme_associate_conf.
 *
 * @param AssocShortAddress    Short address allocated by the coordinator.
 * @param status               Result of requested association operation.
 *
 * @return void
 *
 */
void usr_mlme_associate_conf(uint16_t AssocShortAddress,
		uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_ASSOCIATE_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_ASSOCIATE_CONFIRM;

#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = AssocShortAddress >> 8;
	*msg_buf++ = AssocShortAddress;
#else
	*msg_buf++ = AssocShortAddress;
	*msg_buf++ = AssocShortAddress >> 8;
#endif
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#endif  /* (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) */

#if (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)

/*
 * @brief Callback function usr_mlme_associate_ind
 *
 * @param DeviceAddress         Extended address of device requesting
 *association
 * @param CapabilityInformation Capabilities of device requesting association
 */
void usr_mlme_associate_ind(uint64_t DeviceAddress,
		uint8_t CapabilityInformation)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_ASSOCIATE_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_ASSOCIATE_INDICATION;
	memcpy(msg_buf, &DeviceAddress, 8);
	msg_buf += 8;
	*msg_buf++ = CapabilityInformation;
	*msg_buf = EOT;
}

#endif  /* (MAC_ASSOCIATION_INDICATION_RESPONSE == 1) */

#if (MAC_BEACON_NOTIFY_INDICATION == 1)

/*
 * Callback function usr_mlme_beacon_notify_ind
 *
 * @param BSN            Beacon sequence number.
 * @param PANDescriptor  Pointer to PAN descriptor for received beacon.
 * @param PendAddrSpec   Pending address specification in received beacon.
 * @param AddrList       List of addresses of devices the coordinator has
 *pending data.
 * @param sduLength      Length of beacon payload.
 * @param sdu            Pointer to beacon payload.
 *
 * @return void
 *
 */
void usr_mlme_beacon_notify_ind(uint8_t BSN,
		wpan_pandescriptor_t *PANDescriptor,
		uint8_t PendAddrSpec,
		uint8_t *AddrList,
		uint8_t sduLength,
		uint8_t *sdu)
{
	uint8_t *msg_buf;
	/* Pointer to size element - the content is written later. */
	uint8_t *msg_ptr_to_size;
	uint8_t short_addr_list = WPAN_NUM_SHORT_ADDR_PENDING(PendAddrSpec) *
			sizeof(uint16_t);
	uint8_t ext_addr_list = WPAN_NUM_EXTENDED_ADDR_PENDING(PendAddrSpec) *
			sizeof(uint64_t);

	msg_buf = get_next_tx_buffer();
	/* Store pointer to size element. */
	msg_ptr_to_size = msg_buf;

	*msg_buf++ = MLME_BEACON_NOTIFY_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_BEACON_NOTIFY_INDICATION;
	*msg_buf++ = BSN;

	/*
	 * Since the wpan_desc_ptr_t might have various sizes depending
	 * on the platform type (8 bit vs. 32 bit), but the test
	 * harness requires strict 8 bit oriented structure layouts,
	 * the wpan descriptor cannot be copied via memcpy here.
	 */
	*msg_buf++ = PANDescriptor->CoordAddrSpec.AddrMode;

#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = PANDescriptor->CoordAddrSpec.PANId >> 8;
	*msg_buf++ = PANDescriptor->CoordAddrSpec.PANId;
#else
	*msg_buf++ = PANDescriptor->CoordAddrSpec.PANId;
	*msg_buf++ = PANDescriptor->CoordAddrSpec.PANId >> 8;
#endif
	memcpy(msg_buf, &(PANDescriptor->CoordAddrSpec.Addr), 8);
	msg_buf += 8;

	*msg_buf++ = PANDescriptor->LogicalChannel;
	*msg_buf++ = PANDescriptor->ChannelPage;
	*msg_buf++ = PANDescriptor->SuperframeSpec;
	*msg_buf++ = PANDescriptor->SuperframeSpec >> 8;
	*msg_buf++ = PANDescriptor->GTSPermit;
	*msg_buf++ = PANDescriptor->LinkQuality;
#ifdef ENABLE_TSTAMP
	*msg_buf++ = PANDescriptor->TimeStamp;
	*msg_buf++ = PANDescriptor->TimeStamp >> 8;
	*msg_buf++ = PANDescriptor->TimeStamp >> 16;
	*msg_buf++ = PANDescriptor->TimeStamp >> 24;
#endif  /* ENABLE_TSTAMP */

	*msg_ptr_to_size += WPAN_DESCRIPTOR_LEN;

	*msg_buf++ = PendAddrSpec;
	*msg_ptr_to_size += 1;

	/* Variable data portion */
	*msg_buf++ = sduLength + short_addr_list + ext_addr_list;
	*msg_ptr_to_size += 1;

	/* Sizes of short address list and extended address list */
	memcpy(msg_buf, AddrList, short_addr_list);
	msg_buf += short_addr_list;
	*msg_ptr_to_size += short_addr_list;
	memcpy(msg_buf,
			(uint8_t *)AddrList + short_addr_list,
			ext_addr_list);
	msg_buf += ext_addr_list;
	*msg_ptr_to_size += ext_addr_list;

	/* SDU */
	memcpy(msg_buf, sdu, sduLength);
	msg_buf += sduLength;
	*msg_ptr_to_size += sduLength;

