avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
	*msg_buf = EOT;
}

#endif  /* (MAC_BEACON_NOTIFY_INDICATION == 1) */

#if ((MAC_ORPHAN_INDICATION_RESPONSE == 1) || \
	(MAC_ASSOCIATION_INDICATION_RESPONSE == 1))

/*
 * @brief Callback function usr_mlme_comm_status_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param status           Result for related response operation
 */
void usr_mlme_comm_status_ind(wpan_addr_spec_t *SrcAddrSpec,
		wpan_addr_spec_t *DstAddrSpec,
		uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();

	*msg_buf++ = MLME_COMM_STATUS_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_COMM_STATUS_INDICATION;

	/* Do not change order of the elements */
#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = SrcAddrSpec->PANId >> 8;
	*msg_buf++ = SrcAddrSpec->PANId;
#else
	*msg_buf++ = SrcAddrSpec->PANId;
	*msg_buf++ = SrcAddrSpec->PANId >> 8;
#endif
	*msg_buf++ = SrcAddrSpec->AddrMode;
	memcpy(msg_buf, &(SrcAddrSpec->Addr), 8);
	msg_buf += 8;
	*msg_buf++ = DstAddrSpec->AddrMode;
	memcpy(msg_buf, &(DstAddrSpec->Addr), 8);

	msg_buf += 8;
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#endif  /* ((MAC_ORPHAN_INDICATION_RESPONSE == 1) ||
         *(MAC_ASSOCIATION_INDICATION_RESPONSE == 1)) */

#if (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)

/*
 * Callback function usr_mlme_disassociate_conf
 *
 * @param status             Result of requested disassociate operation.
 * @param DeviceAddrSpec     Pointer to wpan_addr_spec_t structure for device
 *                           that has either requested disassociation or been
 *                           instructed to disassociate by its coordinator.
 *
 * @return void
 */
void usr_mlme_disassociate_conf(uint8_t status,
		wpan_addr_spec_t *DeviceAddrSpec)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();

	*msg_buf++ = MLME_DISASSOCIATE_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_DISASSOCIATE_CONFIRM;

	*msg_buf++ = status;

	*msg_buf++ = DeviceAddrSpec->AddrMode;
#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = DeviceAddrSpec->PANId >> 8;
	*msg_buf++ = DeviceAddrSpec->PANId;
#else
	*msg_buf++ = DeviceAddrSpec->PANId;
	*msg_buf++ = DeviceAddrSpec->PANId >> 8;
#endif
	memcpy(msg_buf, &(DeviceAddrSpec->Addr), 8);
	msg_buf += 8;
	*msg_buf = EOT;
}

#endif /* (MAC_DISASSOCIATION_BASIC_SUPPORT == 1) */

#if (MAC_DISASSOCIATION_BASIC_SUPPORT == 1)

/*
 * Callback function usr_mlme_disassociate_ind
 *
 * @param DeviceAddress        Extended address of device which initiated the
 *                             disassociation request.
 * @param DisassociateReason   Reason for the disassociation. Valid values:
 *                           - @ref WPAN_DISASSOC_BYPARENT,
 *                           - @ref WPAN_DISASSOC_BYCHILD.
 *
 * @return void
 */
void usr_mlme_disassociate_ind(uint64_t DeviceAddress,
		uint8_t DisassociateReason)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_DISASSOCIATE_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_DISASSOCIATE_INDICATION;
	memcpy(msg_buf, &DeviceAddress, 8);
	msg_buf += 8;
	*msg_buf++ = DisassociateReason;
	*msg_buf = EOT;
}

#endif  /* (MAC_DISASSOCIATION_BASIC_SUPPORT == 1) */

#if (MAC_GET_SUPPORT == 1)

/*
 * Callback function usr_mlme_get_conf
 *
 * @param status            Result of requested PIB attribute get operation.
 * @param PIBAttribute      Retrieved PIB attribute.
 * @param PIBAttributeIndex Index of the PIB attribute to be read.
 * @param PIBAttributeValue Pointer to data containing retrieved PIB attribute,
 *
 * @return void
 */
void usr_mlme_get_conf(uint8_t status,
		uint8_t PIBAttribute,
		void *PIBAttributeValue)
{
	uint8_t *msg_buf;
	uint8_t pib_attribute_octet_no;
	/* Pointer to size element - the content is written later. */
	uint8_t *msg_ptr_to_size;

	msg_buf = get_next_tx_buffer();
	/* Store pointer to size element. */
	msg_ptr_to_size = msg_buf;

	*msg_buf++ = MLME_GET_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_GET_CONFIRM;
	*msg_buf++ = status;
	*msg_buf++ = PIBAttribute;

	/* Get size of PIB attribute to be set */
	pib_attribute_octet_no = mac_get_pib_attribute_size(PIBAttribute);
	*msg_buf++ = pib_attribute_octet_no;

	/* Attribute value */

#ifdef TEST_HARNESS_BIG_ENDIAN
	if ((macMaxFrameTotalWaitTime == PIBAttribute) ||
			(macResponseWaitTime == PIBAttribute) ||
			(macTransactionPersistenceTime == PIBAttribute) ||
			(macBeaconTxTime == PIBAttribute)
#ifdef MAC_SECURITY_ZIP
			|| (macFrameCounter == PIBAttribute) ||
			(macDefaultKey == PIBAttribute)
#endif
			) {
		memcpy_be(msg_buf, PIBAttributeValue, pib_attribute_octet_no);
	} else {
		memcpy(msg_buf, PIBAttributeValue, pib_attribute_octet_no);
	}

#else
	memcpy(msg_buf, PIBAttributeValue, pib_attribute_octet_no);
#endif

	msg_buf += pib_attribute_octet_no;
	*msg_ptr_to_size += pib_attribute_octet_no;

	*msg_buf = EOT;
}

#endif  /* (MAC_GET_SUPPORT == 1) */

#if (MAC_ORPHAN_INDICATION_RESPONSE == 1)

/*
 * Callback function usr_mlme_orphan_ind
 *
 * @param OrphanAddress     Address of orphaned device.
 *
 * @return void
 *
 */
void usr_mlme_orphan_ind(uint64_t OrphanAddress)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_ORPHAN_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_ORPHAN_INDICATION;
	memcpy(msg_buf, &OrphanAddress, 8);
	msg_buf += 8;
	*msg_buf = EOT;
}

#endif  /* (MAC_ORPHAN_INDICATION_RESPONSE == 1) */

#if (MAC_INDIRECT_DATA_BASIC == 1)

/*
 * Callback function that must be implemented by application (NHLE) for MAC
 *service
 * MLME-POLL.confirm.
 *
 * @param status           Result of requested poll operation.
 *
 * @return void
 *
 */
void usr_mlme_poll_conf(uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_POLL_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_POLL_CONFIRM;
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#endif  /* (MAC_INDIRECT_DATA_BASIC == 1) */

