avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
/*
 * @brief Callback function usr_mlme_reset_conf
 *
 * @param status Result of the reset procedure
 */
void usr_mlme_reset_conf(uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_RESET_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_RESET_CONFIRM;
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#if (MAC_RX_ENABLE_SUPPORT == 1)

/*
 * Callback function usr_mlme_rx_enable_conf
 *
 * @param status           Result of requested receiver enable operation.
 *
 * @return void
 */
void usr_mlme_rx_enable_conf(uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_RX_ENABLE_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_RX_ENABLE_CONFIRM;
	*msg_buf++ = status;
	*msg_buf = EOT;
}

#endif  /* (MAC_RX_ENABLE_SUPPORT == 1) */

#if ((MAC_SCAN_ED_REQUEST_CONFIRM == 1)      ||	\
	(MAC_SCAN_ACTIVE_REQUEST_CONFIRM == 1)  || \
	(MAC_SCAN_PASSIVE_REQUEST_CONFIRM == 1) || \
	(MAC_SCAN_ORPHAN_REQUEST_CONFIRM == 1))

/*
 * @brief Callback function usr_mlme_scan_conf
 *
 * @param status            Result of requested scan operation
 * @param ScanType          Type of scan performed
 * @param ChannelPage       Channel page on which the scan was performed
 * @param UnscannedChannels Bitmap of unscanned channels
 * @param ResultListSize    Number of elements in ResultList
 * @param ResultList        Pointer to array of scan results
 */
void usr_mlme_scan_conf(uint8_t status,
		uint8_t ScanType,
		uint8_t ChannelPage,
		uint32_t UnscannedChannels,
		uint8_t ResultListSize,
		void *ResultList)
{
	uint8_t *msg_buf;
	/* Pointer to size element - the content is written later. */
	uint8_t *msg_ptr_to_size;

	msg_buf = get_next_tx_buffer();

	/* Store pointer to size element. */
	msg_ptr_to_size = msg_buf;

	*msg_buf++ = MLME_SCAN_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_SCAN_CONFIRM;

	*msg_buf++ = status;
	*msg_buf++ = ScanType;
	*msg_buf++ = ChannelPage;
	*msg_buf++ = UnscannedChannels;
	*msg_buf++ = UnscannedChannels >> 8;
	*msg_buf++ = UnscannedChannels >> 16;
	*msg_buf++ = UnscannedChannels >> 24;
	*msg_buf++ = ResultListSize;

	if ((MLME_SCAN_TYPE_ACTIVE == ScanType) ||
			(MLME_SCAN_TYPE_PASSIVE == ScanType)) {
		wpan_pandescriptor_t *wpan_desc_ptr
			= (wpan_pandescriptor_t *)ResultList;

		if (0 == ResultListSize) {
			*msg_buf++ = 0;
		} else {
			*msg_buf++ = ResultListSize * WPAN_DESCRIPTOR_LEN;

			for (uint8_t i = 0; i < ResultListSize; i++) {
				/*
				 * Since the wpan_desc_ptr_t might have various
				 *sizes depending
				 * on the platform type (8 bit vs. 32 bit), but
				 *the test
				 * harness requires strict 8 bit oriented
				 *structure layouts,
				 * the wpan descriptor cannot be copied via
				 *memcpy here.
				 */
				*msg_buf++
					= wpan_desc_ptr->CoordAddrSpec.AddrMode;
#ifdef TEST_HARNESS_BIG_ENDIAN
				*msg_buf++
					= wpan_desc_ptr->CoordAddrSpec.PANId >>
						8;
				*msg_buf++ = wpan_desc_ptr->CoordAddrSpec.PANId;
#else
				*msg_buf++ = wpan_desc_ptr->CoordAddrSpec.PANId;
				*msg_buf++
					= wpan_desc_ptr->CoordAddrSpec.PANId >>
						8;
#endif
				memcpy(msg_buf,
						&(wpan_desc_ptr->CoordAddrSpec.
						Addr),
						8);
				msg_buf += 8;

				*msg_buf++ = wpan_desc_ptr->LogicalChannel;
				*msg_buf++ = wpan_desc_ptr->ChannelPage;
				*msg_buf++ = wpan_desc_ptr->SuperframeSpec;
				*msg_buf++ = wpan_desc_ptr->SuperframeSpec >> 8;
				*msg_buf++ = wpan_desc_ptr->GTSPermit;
				*msg_buf++ = wpan_desc_ptr->LinkQuality;
#ifdef ENABLE_TSTAMP
				*msg_buf++ = wpan_desc_ptr->TimeStamp;
				*msg_buf++ = wpan_desc_ptr->TimeStamp >> 8;
				*msg_buf++ = wpan_desc_ptr->TimeStamp >> 16;
				*msg_buf++ = wpan_desc_ptr->TimeStamp >> 24;
#endif  /* ENABLE_TSTAMP */

				wpan_desc_ptr++;
				*msg_ptr_to_size += WPAN_DESCRIPTOR_LEN;
			}
		}
	} else if (MLME_SCAN_TYPE_ED == ScanType) {
		if (0 == ResultListSize) {
			*msg_buf++ = 0;
		} else {
			*msg_buf++ = ResultListSize;
			memcpy(msg_buf, (uint8_t *)ResultList, ResultListSize);
			msg_buf += ResultListSize;
			*msg_ptr_to_size += ResultListSize;
		}
	} else { /* Orphan Scan */
		*msg_buf++ = ResultListSize;
		*msg_buf++ = 0; /* no variable part */
		*msg_ptr_to_size += 1;
	}

	*msg_buf = EOT;
}

#endif

/*
 * @brief Callback function usr_mlme_set_conf
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 */
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_SET_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_SET_CONFIRM;
	*msg_buf++ = status;
	*msg_buf++ = PIBAttribute;
	*msg_buf = EOT;
}

#if (MAC_START_REQUEST_CONFIRM == 1)

/*
 * @brief Callback function usr_mlme_start_conf
 *
 * @param status        Result of requested start operation
 */
void usr_mlme_start_conf(uint8_t status)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();

	*msg_buf++ = MLME_START_CONF_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_START_CONFIRM;
	*msg_buf++ = status;

	*msg_buf = EOT;
}

#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

/*
 * Callback function usr_mlme_sync_loss_ind
 *
 * @param LossReason     Reason for synchronization loss.
 * @param PANId          The PAN identifier with which the device lost
 *                       synchronization or to which it was realigned.
 * @param LogicalChannel The logical channel on which the device lost
 *                       synchronization or to which it was realigned.
 * @param ChannelPage    The channel page on which the device lost
 *                       synchronization or to which it was realigned.
 *
 * @return void
 *
 */
void usr_mlme_sync_loss_ind(uint8_t LossReason,
		uint16_t PANId,
		uint8_t LogicalChannel,
		uint8_t ChannelPage)
{
	uint8_t *msg_buf;

	msg_buf = get_next_tx_buffer();
	*msg_buf++ = MLME_SYNC_LOSS_IND_LEN + MAC_PID_LEN;
	*msg_buf++ = MAC_PID;
	*msg_buf++ = MLME_SYNC_LOSS_INDICATION;
	*msg_buf++ = LossReason;
#ifdef TEST_HARNESS_BIG_ENDIAN
	*msg_buf++ = PANId >> 8;
	*msg_buf++ = PANId;
#else
	*msg_buf++ = PANId;
	*msg_buf++ = PANId >> 8;
#endif

	*msg_buf++ = LogicalChannel;
	*msg_buf++ = ChannelPage;
	*msg_buf = EOT;
}

/**
 * \brief Parses the Received Data in the Buffer and Process the Commands
 *accordingly.
 */
static void handle_incoming_msg(void)
{
	bool ret_val;
	switch (sio_rx_buf[1]) { /* Protocol Identifier type*/
	case MAC_PID:
	{
		switch (sio_rx_buf[2]) { /* message type */
		case MCPS_DATA_REQUEST:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * SrcAddrMode;
			 * DstAddrMode;
			 * DstPANId;
			 * DstAddr;
			 * msduHandle;
			 * TxOptions;
			 * msduLength;
			 * msdu*;
			 */
			uint8_t src_addr_mode = sio_rx_buf[3];
			wpan_addr_spec_t dst_addr;

