avrxml/asf/thirdparty/wireless/avr2025_mac/addons/serial_if/src/serial_interface.c
		case MLME_POLL_REQUEST:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * CoordAddrMode uint8_t;
			 * CoordPANId uint16_t;
			 * CoordAddress uint64_t;
			 */

			/*
			 * bool wpan_mlme_poll_req(wpan_addr_spec_t
			 * *CoordAddrSpec);
			 */

			wpan_addr_spec_t coord_addr;

			coord_addr.AddrMode = sio_rx_buf[3];
			coord_addr.PANId
				= ((uint16_t)sio_rx_buf[4] |
					((uint16_t)sio_rx_buf[5]
					<< 8));
#ifdef TEST_HARNESS_BIG_ENDIAN
			if (FCF_SHORT_ADDR == coord_addr.AddrMode) {
				memcpy(&(coord_addr.Addr.short_address),
						&sio_rx_buf[6],
						sizeof(uint16_t));
			} else {
				memcpy(&(coord_addr.Addr.long_address),
						&sio_rx_buf[6],
						sizeof(uint64_t));
			}

#else
			memcpy(&coord_addr.Addr.long_address, &sio_rx_buf[6],
					sizeof(uint64_t));
#endif

			ret_val = wpan_mlme_poll_req(&coord_addr);

			if (ret_val == false) {
				Assert(
						"Test harness: Poll Request not successful" ==
						0);
			}
		}
		break;

		case MLME_RESET_REQUEST:

			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * SetDefaultPIB;
			 */
			/* bool mlme_reset_request(bool SetDefaultPIB); */
			ret_val = wpan_mlme_reset_req(sio_rx_buf[3]);

			if (ret_val == false) {
				Assert(
						"Test harness: Reset Request not successful" ==
						0);
			}

			break;

		case MLME_RX_ENABLE_REQUEST:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * DeferPermit uint8_t;
			 * RxOnTime uint32_t;
			 * RxOnDuration uint32_t;
			 */

			/*
			 * bool wpan_mlme_rx_enable_req(bool DeferPermit,
			 *                            uint32_t RxOnTime,
			 *                            uint32_t RxOnDuration);
			 */

			ret_val = wpan_mlme_rx_enable_req(sio_rx_buf[3],
					/* RxOnTime */
					((uint32_t)sio_rx_buf[4] |
					((uint32_t)sio_rx_buf[5]
					<< 8) |
					(uint32_t)sio_rx_buf[6] << 16 |
					((uint32_t)sio_rx_buf[7]
					<< 24)
					),
					/* RxOnDuration */
					((uint32_t)sio_rx_buf[8] |
					((uint32_t)sio_rx_buf[9]
					<< 8) |
					(uint32_t)sio_rx_buf[10] << 16 |
					((uint32_t)sio_rx_buf[11
					] << 24)
					)
					);
			if (ret_val == false) {
				Assert(
						"Test harness: Rx_Enable Request not successful" ==
						0);
			}
		}
		break;

		case MLME_SCAN_REQUEST:
		{
			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * ScanType;
			 * uint32_t ScanChannels;
			 * uint8_t ScanDuration;
			 * uint8_t ChannelPage;
			 */

			/*
			 * bool wpan_mlme_scan_req(uint8_t ScanType,
			 *                       uint32_t ScanChannels,
			 *                       uint8_t ScanDuration,
			 *                       uint8_t ChannelPage);
			 */
			uint32_t scan_channels = ((uint32_t)sio_rx_buf[4] |
					((uint32_t)sio_rx_buf[5] << 8) |
					((uint32_t)sio_rx_buf[6] << 16) |
					((uint32_t)sio_rx_buf[7] << 24)
					);

			ret_val = wpan_mlme_scan_req(sio_rx_buf[3],          /*
					                                      * ScanType */
					scan_channels,                       /*
					                                      * ScanChannels */
					sio_rx_buf[8],                       /*
					                                      * ScanDuration */
					sio_rx_buf[9]);                      /*
					                                      * ChannelPage */
			if (ret_val == false) {
				Assert(
						"Test harness: Scan Request not successful" ==
						0);
			}
		}
		break;

		case MLME_SET_REQUEST:

			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * PIBAttribute;
			 * PIBAttributeValue;
			 */

			/*
			 * bool wpan_mlme_set_req(uint8_t PIBAttribute,
			 *                      uint8_t *PIBAttributeValue);
			 */

			ret_val = wpan_mlme_set_req(sio_rx_buf[3],
					&sio_rx_buf[5]);

			if (ret_val == false) {
				Assert(
						"Test harness: Set Request not successful" ==
						0);
			}

			break;

#if (MAC_START_REQUEST_CONFIRM == 1)
		case MLME_START_REQUEST:

			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * PANId uint16_t;
			 * LogicalChannel uint8_t;
			 * ChannelPage uint8_t;
			 * BeaconOrder uint8_t;
			 * SuperframeOrder uint8_t;
			 * PANCoordinator uint8_t;
			 * BatteryLifeExtension uint8_t;
			 * CoordRealignment uint8_t;
			 */

			/*
			 * bool wpan_mlme_start_req(uint16_t PANId,
			 *                        uint8_t LogicalChannel,
			 *                        uint8_t ChannelPage,
			 *                        uint8_t BeaconOrder,
			 *                        uint8_t SuperframeOrder,
			 *                        bool PANCoordinator,
			 *                        bool BatteryLifeExtension,
			 *                        bool CoordRealignment);
			 */
			ret_val = wpan_mlme_start_req(
					(uint16_t)sio_rx_buf[3] |
					((uint16_t)sio_rx_buf[4] << 8),
					sio_rx_buf[5],
					sio_rx_buf[6],
					sio_rx_buf[7],
					sio_rx_buf[8],
					sio_rx_buf[9],
					sio_rx_buf[10],
					sio_rx_buf[11]);
			if (ret_val == false) {
				Assert(
						"Test harness: Start Request not successful" ==
						0);
			}
			break;
#endif  /* (MAC_START_REQUEST_CONFIRM == 1) */

#if (MAC_SYNC_REQUEST == 1)
		case MLME_SYNC_REQUEST:

			/* Order of reception:
			 * size;
			 * ProtocolId,
			 * cmdCode;
			 * LogicalChannel uint8_t;
			 * ChannelPage uint8_t;
			 * TrackBeacon uint8_t;
			 */

			/*
			 * bool wpan_mlme_sync_req(uint8_t LogicalChannel,
			 *                       uint8_t ChannelPage,
			 *                       bool TrackBeacon);
			 */
			ret_val = wpan_mlme_sync_req(sio_rx_buf[3],
					sio_rx_buf[4],
					sio_rx_buf[5]);
			if (ret_val == false) {
				Assert(
						"Test harness: Sync Request not successful" ==
						0);
			}
			break;
#endif /* (MAC_SYNC_REQUEST == 1) */

		default:
			Assert("???" == 0);
			break;
		}
	}
	break;

	default:
		Assert("???" == 0);
		break;
	}
}

/**
 * @brief Process data received from SIO
 */
static inline void process_incoming_sio_data(void)
{
	switch (sio_rx_state) {
	case UART_RX_STATE_SOT:
		sio_rx_ptr = sio_rx_buf;
		if (SOT == data[rx_index]) {
			sio_rx_state = UART_RX_STATE_LENGTH;
		}

		break;

	case UART_RX_STATE_LENGTH:
		sio_rx_length = data[rx_index];
		if (sio_rx_length) {
			sio_rx_state = UART_RX_STATE_DATA;
			*sio_rx_ptr = sio_rx_length;
			sio_rx_ptr++;
		} else {
			/* NULL message */
			sio_rx_ptr = sio_rx_buf;
			sio_rx_state = UART_RX_STATE_SOT;
		}

		break;

	case UART_RX_STATE_DATA:
		*sio_rx_ptr = data[rx_index];
		sio_rx_ptr++;
		sio_rx_length--;
		if (!sio_rx_length) {
			sio_rx_state = UART_RX_STATE_EOT;
		}

		break;

	case UART_RX_STATE_EOT:
		if (EOT == data[rx_index]) {
			/* Message received successfully */
			handle_incoming_msg();
		}

		/* Make rx buffer ready for next reception before handling
		 *received data. */
		sio_rx_ptr = sio_rx_buf;
		sio_rx_state = UART_RX_STATE_SOT;
		break;

	default:
		sio_rx_ptr = sio_rx_buf;
		sio_rx_state = UART_RX_STATE_SOT;
		break;
	}
}

/*
 * @brief Function to handle the state machine serial data exchange.
 */
void serial_data_handler(void)
{
	/* Rx processing */
	if (data_length == 0) {
		/* No data to process, read the stream IO */
		rx_index = 0;
		data_length = sio2host_rx(data, SIO_RX_BUF_SIZE); /* @ToDo 20 ?,
		                                                   * different
		                                                   * values for
		                                                   * USB and
		                                                   * UART ? */
	} else { /* Data has been received, process the data */
		/* Process each single byte */
		process_incoming_sio_data();
		data_length--;
		rx_index++;
	}

	/* Tx processing */
	if (buf_count != 0) {
		if (sio2host_tx(sio_tx_buf[head],
				(sio_tx_buf[head][1] + 3)) != 0) {
			head++;
			head %= SIO_BUF_COUNT;
			buf_count--;
		} else {
			/* @ToDo what happens if none or only a part of the
			 * bytes could be transmitted? */
		}
	}
}
